error.server.home.validate=CWWKM2100E: Quando l'attributo serverHome \u00e8 impostato, deve puntare a una directory che contiene lib/ws-launch.jar.
error.server.home.validate.explanation=L'attributo serverHome deve puntare a una directory che contiene lib/ws-launch.jar.
error.server.home.validate.useraction=Controllare se il server \u00e8 installato correttamente.

error.server.assembly.twice.set=CWWKM2101E: Assembly server specificato due volte; specificare una sola coordinata maven in assemblyArtifact o un file in assemblyArchive.
error.server.assembly.twice.set.explanation=Assembly server specificato due volte.
error.server.assembly.twice.set.useraction=Specificare una sola coordinata maven in assemblyArtifact o un file in assemblyArchive.

info.variable.set=CWWKM2102I: Utilizzo di {0} : {1}.
info.variable.set.explanation=Mostrare il valore della variabile.
info.variable.set.useraction=Non sono richieste azioni.

error.server.assembly.validate=CWWKM2103E: Non \u00e8 stato specificato alcun assembly server: specificare le coordinate maven in assemblyArtifact o un file in assemblyArchive
error.server.assembly.validate.explanation=Non \u00e8 stato specificato alcun assembly server.
error.server.assembly.validate.useraction=Specificare assemblyArtifact oppure un file in assemblyArchive

debug.discover.server.home=CWWKM2104I: Rilevamento in corso della variabile serverHome...
debug.discover.server.home.explanation=Il plugin maven sta rilevando il valore corretto della variabile serverHome
debug.discover.server.home.useraction=Non sono richieste azioni.

error.discover.server.home.fail=CWWKM2105E: Impossibile determinare il serverHome durante la scansione dell''archivio {0} per lib/ws-launch.jar.
error.discover.server.home.fail.explanation=L'archivio server fornito non contiene lib/ws-launch.jar.
error.discover.server.home.fail.useraction=Controllare il contenuto dell'archivio server.

error.archive.not.contain.server=CWWKM2106E: L''archivio non contiene un assembly server: {0}.
error.archive.not.contain.server.explanation=L'archivio non contiene un assembly server.
error.archive.not.contain.server.useraction=Controllare il contenuto dell'archivio server.

info.install.type.preexisting=CWWKM2107I: Il tipo di installazione \u00e8 preesistente; l'installazione verr\u00e0 tralasciata.
info.install.type.preexisting.explanation=Il server \u00e8 gi\u00e0 installato. Verr\u00e0 utilizzata tale installazione esistente.
info.install.type.preexisting.useraction=Non sono richieste azioni.

debug.detect.assembly.archive=CWWKM2108I: \u00c8 stato rilevato un nuovo archivio assembly.
debug.detect.assembly.archive.explanation=Informazioni di debug del rilevamento dell'archivio assembly.
debug.detect.assembly.archive.useraction=Non sono richieste azioni.

debug.request.refresh=CWWKM2109I: L'utente ha richiesto un aggiornamento dell'installazione.
debug.request.refresh.explanation=\u00c8 stato richiesto un aggiornamento dell'installazione.
debug.request.refresh.useraction=Non sono richieste azioni.

info.uninstalling.server.home=CWWKM2110I: Disinstallazione: {0}.
info.uninstalling.server.home.explanation=Disinstallare il server.
info.uninstalling.server.home.useraction=Non sono richieste azioni.

info.install.assembly=CWWKM2111I: Installazione dell'assembly in corso...
info.install.assembly.explanation=\u00c8 in corso l'installazione di un server dall'assembly server.
info.install.assembly.useraction=Non sono richieste azioni.

info.reuse.installed.assembly=CWWKM2112I: Riutilizzo di un assembly installato precedentemente.
info.reuse.installed.assembly.explanation=L'assembly esistente sar\u00e0 riutilizzato.
info.reuse.installed.assembly.useraction=Non sono richieste azioni.

info.waiting.message=CWWKM2113I: Attesa per {0} secondi.
info.waiting.message.explanation=Attendere un certo intervallo di tempo prima che termini l'attivit\u00e0.
info.waiting.message.useraction=Non sono richieste azioni.

warn.read.log.fail=CWWKM2114W: Impossibile leggere il file di log.
warn.read.log.fail.explanation=Era necessario leggere un file di log ma non \u00e8 stato possibile leggerlo.
warn.read.log.fail.useraction=Controllare lo stato del file console.log.

info.file.validated=CWWKM2115E: Si \u00e8 verificato un errore interno; il file in fase di convalida \u00e8 null.
info.file.validated.explanation=CMSG0001
info.file.validated.useraction=CMSG0002

info.file.validate.noexist=CWWKM2116I: Il file {0} in fase di convalida non esiste.
info.file.validate.noexist.explanation=\u00c8 necessario convalidare un file che per\u00f2 non esiste.
info.file.validate.noexist.useraction=Non sono richieste azioni.

info.look.string.infile=CWWKM2117I: Si sta attualmente ricercando {0} in {1}.
info.look.string.infile.explanation=\u00c8 stata richiesta una ricerca della stringa specificata nel file specificato.
info.look.string.infile.useraction=Non sono richieste azioni.

debug.line=CWWKM2118I: La riga \u00e8 {0}.
debug.line.explanation=\u00c8 stata richiesta una ricerca di una stringa che \u00e8 stata ora individuata.
debug.line.useraction=Non sono richieste azioni.

debug.match.string=CWWKM2119I: Il numero della corrispondenza \u00e8 {0} alla riga {1}
debug.match.string.explanation=\u00c8 stata richiesta una ricerca di una stringa che \u00e8 stata ora individuata.
debug.match.string.useraction=Non sono richieste azioni.

debug.server.log.file=CWWKM2120I: Il file di log del server \u00e8 {0}.
debug.server.log.file.explanation=Mostra il nome del file di log del server che verr\u00e0 utilizzato.
debug.server.log.file.useraction=Non sono richieste azioni.

error.server.home.noexist=CWWKM2121E: Directory assembly preinstallata mancante: {0}.
error.server.home.noexist.explanation=La directory assembly preinstallata \u00e8 obbligatoria.
error.server.home.noexist.useraction=Impostare l'attributo serverHome per puntare alla directory assembly preinstallata.

error.server.noexist= CWWKM2122E: Il server {0} non esiste.
error.server.noexist.explanation=Un server richiesto non esiste.
error.server.noexist.useraction=Correggere la specifica del server richiesto.

info.server.status.check=CWWKM2123I: Controlla stato del server...
info.server.status.check.explanation=Occorre controllare lo stato del server.
info.server.status.check.useraction=Non sono richieste azioni.

info.server.status.running=CWWKM2124I: Il server {0} \u00e8 in esecuzione.
info.server.status.running.explanation=Lo stato del server \u00e8 stato controllato; \u00e8 in esecuzione.
info.server.status.running.useraction=Non sono richieste azioni.

info.server.status.stopped=CWWKM2125I: Server {0} arrestato
info.server.status.stopped.explanation=Lo stato del server \u00e8 stato controllato; \u00e8 arrestato.
info.server.status.stopped.useraction=Non sono richieste azioni.

error.server.create.alreadyexist=CWWKM2126E: Il server {0} gi\u00e0 esiste.
error.server.create.alreadyexist.explanation=\u00c8 stato fatto un tentativo di creare un nuovo server ma non \u00e8 possibile crearlo poich\u00e9 gi\u00e0 esiste.
error.server.create.alreadyexist.useraction=Non sono richieste azioni.

error.server.jar.not.found=CWWKM2127E: Impossibile trovare {0}.
error.server.jar.not.found.explanation=Il file jar specificato non \u00e8 stato trovato.
error.server.jar.not.found.useraction=Verificare che il server sia installato correttamente.

info.server.name=CWWKM2128I: Il nome server \u00e8 {0}
info.server.name.explanation=Il nome del server.
info.server.name.useraction=Non sono richieste azioni.

info.server.create.created=CWWKM2129I: Il server {0} \u00e8 stato creato su {1}.
info.server.create.created.explanation=L'ubicazione del server creato.
info.server.create.created.useraction=Non sono richieste azioni.

info.server.java.agent.file=CWWKM2130I: File agent Java : {0}.
info.server.java.agent.file.explanation=L'ubicazione del file agent Java.
info.server.java.agent.file.useraction=Non sono richieste azioni.

info.server.debug.options=CWWKM2131I: L''opzione di debug {0} \u00e8 stata specificata.
info.server.debug.options.explanation=\u00c8 stata specificata una opzione di debug.
info.server.debug.options.useraction=Non sono richieste azioni.

info.server.package.check=CWWKM2132I: Si sta verificando se il server \u00e8 stato arrestato.
info.server.package.check.explanation=Il plugin maven sta ora verificando se il server \u00e8 stato arrestato
info.server.package.check.useraction=Non sono richieste azioni.

warn.server.stopped=CWWKM2133W: Il server potrebbe non essere stato arrestato.
warn.server.stopped.explanation=Il plugin maven non \u00e8 riuscito a determinare se il server \u00e8 stato arrestato. Il plugin continuer\u00e0 ad attendere finch\u00e9 il server non sar\u00e0 stato arrestato.
warn.server.stopped.useraction=Ricercare la causa per cui potrebbe non essere stato arrestato il server.

info.server.package=CWWKM2134I: Creazione package del server in corso...
info.server.package.explanation=Avvio del package del server.
info.server.package.useraction=Non sono richieste azioni.

info.server.launch.file=CWWKM2135I: File di avvio : {0}.
info.server.launch.file.explanation=L'ubicazione di lib/launch.jar nel server.
info.server.launch.file.useraction=Non sono richieste azioni.

info.server.package.file.location=CWWKM2136I: L''ubicazione del file di package \u00e8 {0}.
info.server.package.file.location.explanation=L'ubicazione del package che verr\u00e0 generato.
info.server.package.file.location.useraction=Non sono richieste azioni.

error.server.package.file.fail=CWWKM2137E: Impossibile creare il package del server poich\u00e9 non \u00e8 stato possibile trovare {0}.
error.server.package.file.fail.explanation=\u00c8 stato fatto un tentativo di creare il package del server ma non \u00e8 stato possibile trovare uno dei file richiesti.
error.server.package.file.fail.useraction=Cercare la causa per cui manca il file richiesto.

error.server.package.no.project=CWWKM2138E: \u00c8 stato richiesto un allegato ma non \u00e8 stato eseguito l'injection di alcun progetto maven.
error.server.package.no.project.explanation=\u00c8 stato richiesto un allegato ma non \u00e8 stato eseguito l'injection di alcun progetto maven.
error.server.package.no.project.useraction=Accertarsi che venga eseguito l'injection del progetto maven prima di richiedere l'allegato.

error.server.install.fail=CWWKM2139E: Impossibile installare il server.
error.server.install.fail.explanation=\u00c8 stato fatto un tentativo di installare un server ma tale tentativo ha avuto esito negativo.
error.server.install.fail.useraction=Controllare i log del server per verificare se sono presenti eventuali messaggi di errore e cercare il motivo della mancata riuscita dell'installazione.

info.server.starting=CWWKM2140I: Avvio del server in corso ...
info.server.starting.explanation=\u00c8 stato richiesto di avviare il server.
info.server.starting.useraction=Non sono richieste azioni.

error.server.start.jvm.invalid=CWWKM2141E: La JVM (java virtual machine) non \u00e8 valida: {0}.
error.server.start.jvm.invalid.explanation=\u00c8 stato richiesto di avviare il server ma non \u00e8 stato possibile avviarlo perch\u00e9 la specifica JVM (java virtual machine) non \u00e8 valida.
error.server.start.jvm.invalid.useraction=Verificare di avere specificato l'ubicazione corretta per il comando java.

info.server.start.jvm.argument=CWWKM2142I: Argomento jvm : {0}.
info.server.start.jvm.argument.explanation=\u00c8 stato richiesto di avviare un server; questo messaggio mostra gli argomenti JVM (java virtual machine) che sono stati specificati.
info.server.start.jvm.argument.useraction=Non sono richieste azioni.

info.server.start.create=CWWKM2143I: Il server {0} non esiste. \u00c8 ora in corso la creazione ...
info.server.start.create.explanation=\u00c8 stato richiesto di avviare un server ma tale server non esiste. Il server sar\u00e0 ora creato e avviato.
info.server.start.create.useraction=Non \u00e8 richiesta alcuna azione se \u00e8 prevista la creazione del server. Se la creazione del server non \u00e8 prevista, eliminare il server di nuova creazione e correggere il nome del server.

info.server.start.update.config=CWWKM2144I: Aggiornare il file di configurazione del server {0} da {1}.
info.server.start.update.config.explanation=La configurazione del server viene aggiornata copiando i file di configurazione del server dall'ubicazione specificata.
info.server.start.update.config.useraction=Non sono richieste azioni.

info.server.start.wait=CWWKM2145I: In attesa dell'avvio del server.
info.server.start.wait.explanation=\u00c8 stato richiesto di avviare il server ed \u00e8 ora in corso la lettura dei log del server per individuare il messaggio che indica che il server \u00e8 stato avviato.
info.server.start.wait.useraction=Non sono richieste azioni.

debug.server.start.verify.timeout=CWWKM2146I: Avvio dell''attivit\u00e0 di verifica del timeout con un timeout di {0} secondi.
debug.server.start.verify.timeout.explanation=\u00c8 stato richiesto di avviare il server e attendere per un numero massimo di secondi che il server venga avviato.
debug.server.start.verify.timeout.useraction=Non sono richieste azioni.

info.server.start.timeout=CWWKM2147I: Attesa di {0} secondi per la conferma dell''avvio del server in corso ...
info.server.start.timeout.explanation=\u00c8 stato richiesto di avviare il server e attendere per un numero massimo di secondi che il server venga avviato.
info.server.start.timeout.useraction=Non sono richieste azioni.

error.server.start.verify=CWWKM2148E: Impossibile verificare se il server \u00e8 stato avviato dopo {0} secondi.
error.server.start.verify.explanation=\u00c8 stato richiesto l'avvio del server ma non ne \u00e8 stato completato l'avvio entro il tempo specificato.
error.server.start.verify.useraction=Controllare il log di traccia e quello della console del server per rilevare eventuali errori e ricercare la causa del mancato avvio del server.

error.server.start.fail=CWWKM2149E: Impossibile avviare il server
error.server.start.fail.explanation=\u00c8 stato richiesto l'avvio del server ma non \u00e8 stato possibile avviarlo.
error.server.start.fail.useraction=Controllare i log di traccia e della console del server per determinare perch\u00e9 non \u00e8 stato possibile avviare il server.

info.server.started=CWWKM2150I: Server avviato in {0}.
info.server.started.explanation=\u00c8 stato richiesto l'avvio del server e il server \u00e8 ora pronto.
info.server.started.useraction=Non sono richieste azioni.

info.server.start.wait.shutdown=CWWKM2151I: In attesa dell'arresto del server.
info.server.start.wait.shutdown.explanation=\u00c8 stato richiesto di arrestare il server.
info.server.start.wait.shutdown.useraction=Non sono richieste azioni.

info.server.stopping=CWWKM2152I: Arresto del server in corso ...
info.server.stopping.explanation=\u00c8 stato richiesto di arrestare il server.
info.server.stopping.useraction=Non sono richieste azioni.

info.server.stop.completely=CWWKM2153I: Il server \u00e8 stato arrestato.
info.server.stop.completely.explanation=\u00c8 stato richiesto di arrestare il server e esso \u00e8 ora arrestato.
info.server.stop.completely.useraction=Non sono richieste azioni.

error.server.stop=CWWKM2154E: Impossibile arrestare il server. Il messaggio di arresto del server non \u00e8 stato trovato nel console.log.
error.server.stop.explanation=\u00c8 stato richiesto un arresto del server ma nel console.log non \u00e8 stato trovato un messaggio di arresto del server.
error.server.stop.useraction=Controllare il log di traccia e quello della console del server per determinare perch\u00e9 il server non \u00e8 stato arrestato.

error.deploy.app.set.validate=CWWKM2155E: Non ci sono applicazioni da distribuire come specificato dall'attributo appArchive.
error.deploy.app.set.validate.explanation=\u00c8 stata richiesta la distribuzione di un'applicazione ma non \u00e8 stato possibile individuare l'applicazione.
error.deploy.app.set.validate.useraction=Controllare la specifica dell'attributo appArchive.

info.deploy.app=CWWKM2156I: Distribuzione dell''applicazione {0} in corso...
info.deploy.app.explanation=\u00c8 stata richiesta la distribuzione di un'applicazione e tale distribuzione \u00e8 in fase di avvio.
info.deploy.app.useraction=Non sono richieste azioni.

error.deploy.app.fail=CWWKM2157E: Impossibile distribuire l''applicazione {0}.
error.deploy.app.fail.explanation=\u00c8 stata richiesta la distribuzione di un'applicazione ma tale distribuzione ha avuto esito negativo.
error.deploy.app.fail.useraction=Controllare il file server.xml del server al quale si sta distribuendo l'applicazione. Il file server.xml deve specificare tutte le funzioni richieste dall'applicazione.

info.start.app=CWWKM2158I: L''applicazione {0} \u00e8 gi\u00e0 stata avviata su {1}.
info.start.app.explanation=\u00c8 stata richiesta la distribuzione di un'applicazione ma l'applicazione \u00e8 gi\u00e0 stata avviata.
info.start.app.useraction=Non sono richieste azioni.

error.deploy=CWWKM2159E: Liberty supporta solo la distribuzione di file war, eba, zip, ear o jar.
error.deploy.explanation=Il server Liberty supporta solo la distribuzione di file war, eba, zip, ear e jar.
error.deploy.useraction=Correggere il nome del file dell'applicazione.

info.install.app=CWWKM2160I: Installazione dell''applicazione {0}.
info.install.app.explanation=\u00c8 stata richiesta l'installazione di un'applicazione.
info.install.app.useraction=Non sono richieste azioni.

error.undeploy.app.set.validate=CWWKM2161E: L'attributo appArchive \u00e8 richiesto per l'attivit\u00e0 di annullamento distribuzione.
error.undeploy.app.set.validate.explanation=appArchive non \u00e8 impostato correttamente.
error.undeploy.app.set.validate.useraction=Impostare l'attributo appArchive per l'attivit\u00e0 di annullamento distribuzione.

error.undeploy.app.noexist=CWWKM2162E: L''applicazione {0} non esiste.
error.undeploy.app.noexist.explanation=L'attivit\u00e0 di annullamento della distribuzione non pu\u00f2 annullare la distribuzione dell'applicazione poich\u00e9 tale applicazione non esiste.
error.undeploy.app.noexist.useraction=Controllare se l'applicazione esiste nella cartella dropins.

info.undeploy.app=CWWKM2163I: Annullamento della distribuzione dell''applicazione {0}.
info.undeploy.app.explanation=\u00c8 stato richiesto l'annullamento della distribuzione dell'applicazione.
info.undeploy.app.useraction=Non sono richieste azioni.

info.undeploy.success=CWWKM2164I: La distribuzione dell''applicazione {0} \u00e8 stata annullata correttamente.
info.undeploy.success.explanation=\u00c8 stato richiesto, e completato, l'annullamento della distribuzione di un'applicazione.
info.undeploy.success.useraction=Non sono richieste azioni.

error.undeploy.app.fail=CWWKM2165E: Impossibile annullare la distribuzione dell''applicazione {0}. Non \u00e8 stato possibile trovare il messaggio di arresto dell''applicazione nel console.log.
error.undeploy.app.fail.explanation=\u00c8 stato richiesto l'annullamento della distribuzione di un'applicazione ma non \u00e8 stato possibile trovare il messaggio che indica che \u00e8 in corso l'arresto dell'applicazione.
error.undeploy.app.fail.useraction=Controllare il log di traccia e quello della console del server per ricercare la causa del mancato arresto dell'applicazione.
