error.server.home.validate=CWWKM2100E: Cuando se establece el atributo serverHome, debe apuntar a un directorio que contenga lib/ws-launch.jar.
error.server.home.validate.explanation=El atributo serverHome debe apuntar a un directorio que contenga lib/ws-launch.jar.
error.server.home.validate.useraction=Compruebe que el servidor se haya instalado correctamente.

error.server.assembly.twice.set=CWWKM2101E: El ensamblaje de servidores se ha especificado dos veces: especifique s\u00f3lo una coordenada experta en assemblyArtifact o un archivo en assemblyArchive.
error.server.assembly.twice.set.explanation=El ensamblaje de servidores se ha especificado dos veces.
error.server.assembly.twice.set.useraction=Especifique s\u00f3lo una coordenada experta en assemblyArtifact o un archivo en assemblyArchive.

info.variable.set=CWWKM2102I: Se utiliza {0} : {1}.
info.variable.set.explanation=Muestra el valor de la variable.
info.variable.set.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.assembly.validate=CWWKM2103E: No se ha especificado ning\u00fan ensamblaje de servidores: especifique coordenadas expertas en assemblyArtifact o un archivo en assemblyArchive
error.server.assembly.validate.explanation=No se ha especificado ning\u00fan ensamblaje de servidores.
error.server.assembly.validate.useraction=Especifique assemblyArtifact o un archivo en assemblyArchive

debug.discover.server.home=CWWKM2104I: Descubriendo la variable serverHome...
debug.discover.server.home.explanation=El plug-in experto est\u00e1 descubriendo el valor correcto de la variable serverHome
debug.discover.server.home.useraction=No se requiere ninguna acci\u00f3n.                         
error.discover.server.home.fail=CWWKM2105E: No se ha podido determinar la variable serverHome al explorar el archivador {0} para lib/ws-launch.jar.
error.discover.server.home.fail.explanation=El archivador de servidor no contiene lib/ws-launch.jar.
error.discover.server.home.fail.useraction=Compruebe el contenido del archivador de servidor.

error.archive.not.contain.server=CWWKM2106E: El archivador no contiene un ensamblaje de servidores: {0}.
error.archive.not.contain.server.explanation=El archivador no contiene un ensamblaje de servidores.
error.archive.not.contain.server.useraction=Compruebe el contenido del archivador de servidor.

info.install.type.preexisting=CWWKM2107I: El tipo de instalaci\u00f3n existe previamente; se omite la instalaci\u00f3n.
info.install.type.preexisting.explanation=El servidor ya est\u00e1 instalado. Se utilizar\u00e1 la instalaci\u00f3n existente.
info.install.type.preexisting.useraction=No se requiere ninguna acci\u00f3n.                         
debug.detect.assembly.archive=CWWKM2108I: Se ha detectado un nuevo archivador de ensamblaje.
debug.detect.assembly.archive.explanation=Informaci\u00f3n de depuraci\u00f3n de detecci\u00f3n de archivadores de ensamblaje.
debug.detect.assembly.archive.useraction=No se requiere ninguna acci\u00f3n.                         
debug.request.refresh=CWWKM2109I: El usuario ha solicitado la renovaci\u00f3n de la instalaci\u00f3n.
debug.request.refresh.explanation=Se ha solicitado una renovaci\u00f3n de la instalaci\u00f3n.
debug.request.refresh.useraction=No se requiere ninguna acci\u00f3n.                         
info.uninstalling.server.home=CWWKM2110I: Desinstalando: {0}.
info.uninstalling.server.home.explanation=Se desinstala el servidor.
info.uninstalling.server.home.useraction=No se requiere ninguna acci\u00f3n.                         
info.install.assembly=CWWKM2111I: Instalando ensamblaje...
info.install.assembly.explanation=Se est\u00e1 instalando un servidor del ensamblaje de servidores.
info.install.assembly.useraction=No se requiere ninguna acci\u00f3n.                         
info.reuse.installed.assembly=CWWKM2112I: Reutilizando un ensamblaje instalado previamente.
info.reuse.installed.assembly.explanation=Se reutilizar\u00e1 el ensamblaje existente.
info.reuse.installed.assembly.useraction=No se requiere ninguna acci\u00f3n.                         
info.waiting.message=CWWKM2113I: Esperando {0} segundos.
info.waiting.message.explanation=Se espera a que pase un tiempo.
info.waiting.message.useraction=No se requiere ninguna acci\u00f3n.                         
warn.read.log.fail=CWWKM2114W: No se ha podido leer el archivo de registro.
warn.read.log.fail.explanation=Debe leerse un archivo de registro, pero no se ha podido leer.
warn.read.log.fail.useraction=Compruebe el estado del archivo console.log.

info.file.validated=CWWKM2115E: Se ha producido un error interno; el archivo que se est\u00e1 validando es nulo.
info.file.validated.explanation=CMSG0001
info.file.validated.useraction=CMSG0002

info.file.validate.noexist=CWWKM2116I: El archivo {0} que se est\u00e1 validando no existe.
info.file.validate.noexist.explanation=Debe validarse un archivo, pero no existe.
info.file.validate.noexist.useraction=No se requiere ninguna acci\u00f3n.                         
info.look.string.infile=CWWKM2117I: Buscando ahora {0} en {1}.
info.look.string.infile.explanation=Se ha solicitado una b\u00fasqueda de la serie especificada en el archivo dado.
info.look.string.infile.useraction=No se requiere ninguna acci\u00f3n.                         
debug.line=CWWKM2118I: La l\u00ednea es {0}.
debug.line.explanation=Se ha solicitado una b\u00fasqueda de una serie que se acaba de localizar.
debug.line.useraction=No se requiere ninguna acci\u00f3n.                         
debug.match.string=CWWKM2119I: El n\u00famero de coincidencia es {0} en la l\u00ednea {1}.
debug.match.string.explanation=Se ha solicitado una b\u00fasqueda de una serie que se acaba de localizar.
debug.match.string.useraction=No se requiere ninguna acci\u00f3n.                         
debug.server.log.file=CWWKM2120I: El archivo de registro de servidor es {0}.
debug.server.log.file.explanation=Muestra el nombre del archivo de registro de servidor que se utilizar\u00e1.
debug.server.log.file.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.home.noexist=CWWKM2121E: Falta el directorio de ensamblaje preinstalado: {0}.
error.server.home.noexist.explanation=El directorio de ensamblaje preinstalado es necesario.
error.server.home.noexist.useraction=Establezca el atributo serverHome para que apunte al directorio de ensamblaje preinstalado.

error.server.noexist= CWWKM2122E: El servidor {0} no existe.
error.server.noexist.explanation=El servidor necesario no existe.
error.server.noexist.useraction=Corrija la especificaci\u00f3n del servidor necesario.

info.server.status.check=CWWKM2123I: Compruebe el estado del servidor...
info.server.status.check.explanation=Debe comprobarse el estado del servidor.
info.server.status.check.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.status.running=CWWKM2124I: El servidor {0} se est\u00e1 ejecutando.
info.server.status.running.explanation=Se ha comprobado el estado del servidor y est\u00e1 en ejecuci\u00f3n.
info.server.status.running.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.status.stopped=CWWKM2125I: Se ha detenido el servidor {0}
info.server.status.stopped.explanation=Se ha comprobado el estado del servidor y est\u00e1 detenido.
info.server.status.stopped.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.create.alreadyexist=CWWKM2126E: El servidor {0} ya existe.
error.server.create.alreadyexist.explanation=Se ha intentado crear un nuevo servidor, pero no puede crearse porque ya existe.
error.server.create.alreadyexist.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.jar.not.found=CWWKM2127E: No se ha podido encontrar {0}.
error.server.jar.not.found.explanation=No se ha encontrado el archivo jar especificado.
error.server.jar.not.found.useraction=Compruebe que el servidor se haya instalado correctamente.

info.server.name=CWWKM2128I: El nombre de servidor es {0}
info.server.name.explanation=Nombre del servidor.
info.server.name.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.create.created=CWWKM2129I: El servidor {0} se ha creado en {1}.
info.server.create.created.explanation=La ubicaci\u00f3n del servidor creado.
info.server.create.created.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.java.agent.file=CWWKM2130I: Archivo de agente Java: {0}.
info.server.java.agent.file.explanation=La ubicaci\u00f3n del archivo de agente Java.
info.server.java.agent.file.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.debug.options=CWWKM2131I: Se ha especificado la opci\u00f3n de depuraci\u00f3n {0}.
info.server.debug.options.explanation=Se ha especificado una opci\u00f3n de depuraci\u00f3n.
info.server.debug.options.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.package.check=CWWKM2132I: Comprobando si se ha detenido el servidor.
info.server.package.check.explanation=El plug-in experto est\u00e1 comprobando ahora si se ha detenido el servidor
info.server.package.check.useraction=No se requiere ninguna acci\u00f3n.                         
warn.server.stopped=CWWKM2133W: El servidor puede que no se haya detenido.
warn.server.stopped.explanation=El plug-in experto no ha podido determinar si el servidor se ha detenido. El plug-in continuar\u00e1 esperando hasta que se haya detenido el servidor.
warn.server.stopped.useraction=Investigue por qu\u00e9 puede que no se haya detenido el servidor.

info.server.package=CWWKM2134I: Empaquetado el servidor...
info.server.package.explanation=Se empieza a empaquetar el servidor.
info.server.package.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.launch.file=CWWKM2135I: Archivo launch: {0}.
info.server.launch.file.explanation=La ubicaci\u00f3n del archivo lib/launch.jar en el servidor.
info.server.launch.file.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.package.file.location=CWWKM2136I: La ubicaci\u00f3n del archivo de paquete es {0}.
info.server.package.file.location.explanation=La ubicaci\u00f3n del paquete  que se generar\u00e1.
info.server.package.file.location.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.package.file.fail=CWWKM2137E: No se ha podido empaquetar el servidor porque no se ha podido encontrar {0}.
error.server.package.file.fail.explanation=Se ha intentado empaquetar el servidor, pero no se encuentra uno de los archivos necesarios.
error.server.package.file.fail.useraction=Investigue por qu\u00e9 falta el archivo necesario.

error.server.package.no.project=CWWKM2138E: Se ha solicitado una conexi\u00f3n pero no se ha inyectado ning\u00fan proyecto experto.
error.server.package.no.project.explanation=Se ha solicitado una conexi\u00f3n, pero no se ha inyectado ning\u00fan proyecto experto.
error.server.package.no.project.useraction=Aseg\u00farese de que el proyecto experto se haya inyectado antes de solicitar la conexi\u00f3n.

error.server.install.fail=CWWKM2139E: No se ha podido instalar el servidor.
error.server.install.fail.explanation=Se ha intentado instalar un servidor, pero el intento ha fallado.
error.server.install.fail.useraction=Compruebe si hay mensajes de error en los registros del servidor e investigue por qu\u00e9 ha fallado la instalaci\u00f3n.

info.server.starting=CWWKM2140I: Iniciando el servidor...
info.server.starting.explanation=Se ha solicitado iniciar el servidor.
info.server.starting.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.start.jvm.invalid=CWWKM2141E: La m\u00e1quina virtual Java no es v\u00e1lida: {0}.
error.server.start.jvm.invalid.explanation=Se ha solicitado iniciar el servidor, pero no se ha podido iniciar porque la especificaci\u00f3n de m\u00e1quina virtual Java no es v\u00e1lida.
error.server.start.jvm.invalid.useraction=Compruebe que haya especificado la ubicaci\u00f3n correcta del mandato java.

info.server.start.jvm.argument=CWWKM2142I: Argumento jvm: {0}.
info.server.start.jvm.argument.explanation=Se ha solicitado iniciar un servidor; este mensaje muestra los argumentos de m\u00e1quina virtual Java especificados.
info.server.start.jvm.argument.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.start.create=CWWKM2143I: El servidor {0} no existe. Se est\u00e1 creando ahora...
info.server.start.create.explanation=Se ha solicitado iniciar un servidor, pero el servidor no exist\u00eda. Ahora se crear\u00e1 y se iniciar\u00e1 el servidor.
info.server.start.create.useraction=No se requiere ninguna acci\u00f3n si se espera la creaci\u00f3n del servidor. Si no se espera la creaci\u00f3n del servidor, suprima el servidor que se acaba de crear y corrija el nombre del servidor.

info.server.start.update.config=CWWKM2144I: Actualizar el archivo de configuraci\u00f3n del servidor {0} desde {1}.
info.server.start.update.config.explanation=Se actualiza la configuraci\u00f3n del servidor copiando los archivos de configuraci\u00f3n del servidor de la ubicaci\u00f3n especificada.
info.server.start.update.config.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.start.wait=CWWKM2145I: Esperando que se inicie el servidor.
info.server.start.wait.explanation=Se ha solicitado iniciar el servidor, y se est\u00e1n leyendo los registros del servidor para ubicar el mensaje iniciado del servidor.
info.server.start.wait.useraction=No se requiere ninguna acci\u00f3n.                         
debug.server.start.verify.timeout=CWWKM2146I: Iniciando la tarea de verificaci\u00f3n de tiempo de espera con un tiempo de espera de {0} segundos.
debug.server.start.verify.timeout.explanation=Se ha solicitado iniciar el servidor, y se est\u00e1 esperando el n\u00famero m\u00e1ximo de segundos para que se inicie el servidor.
debug.server.start.verify.timeout.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.start.timeout=CWWKM2147I: Esperando hasta {0} la confirmaci\u00f3n del inicio del servidor...
info.server.start.timeout.explanation=Se ha solicitado iniciar el servidor, y se est\u00e1 esperando el n\u00famero m\u00e1ximo de segundos para que se inicie el servidor.
info.server.start.timeout.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.start.verify=CWWKM2148E: No se ha podido verificar si el servidor se ha iniciado despu\u00e9s de {0} segundos.
error.server.start.verify.explanation=Se ha solicitado iniciar el servidor, pero no ha terminado de iniciarse en el tiempo especificado.
error.server.start.verify.useraction=Compruebe si hay errores en la consola de servidor y en el registro de rastreo, e investigue por qu\u00e9 no se ha iniciado el servidor.

error.server.start.fail=CWWKM2149E: No se ha podido iniciar el servidor
error.server.start.fail.explanation=Se ha solicitado iniciar el servidor, pero no se ha podido iniciar.
error.server.start.fail.useraction=Compruebe la consola de servidor y el registro de rastreo para determinar por qu\u00e9 no se ha podido iniciar el servidor.

info.server.started=CWWKM2150I: Se ha iniciado el servidor en {0}.
info.server.started.explanation=Se ha realizado una solicitud de iniciar el servidor y ahora est\u00e1 preparado.
info.server.started.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.start.wait.shutdown=CWWKM2151I: Esperando que se concluya el servidor.
info.server.start.wait.shutdown.explanation=Se ha realizado una solicitud para detener el servidor.
info.server.start.wait.shutdown.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.stopping=CWWKM2152I: Deteniendo el servidor...
info.server.stopping.explanation=Se ha realizado una solicitud para detener el servidor.
info.server.stopping.useraction=No se requiere ninguna acci\u00f3n.                         
info.server.stop.completely=CWWKM2153I: El servidor se ha detenido.
info.server.stop.completely.explanation=Se ha realizado una solicitud para detener el servidor y ahora est\u00e1 detenido.
info.server.stop.completely.useraction=No se requiere ninguna acci\u00f3n.                         
error.server.stop=CWWKM2154E: No se ha podido detener el servidor. No se ha encontrado el mensaje de detenci\u00f3n del servidor en console.log.
error.server.stop.explanation=Se ha realizado una solicitud para detener el servidor, pero no se ha encontrado el mensaje de detenci\u00f3n del servidor en console.log
error.server.stop.useraction=Compruebe la consola de servidor y el registro de rastreo para determinar por qu\u00e9 no se ha detenido el servidor.

error.deploy.app.set.validate=CWWKM2155E: No hay ninguna aplicaci\u00f3n que se deba desplegar, tal como se especifica en el atributo appArchive.
error.deploy.app.set.validate.explanation=Se ha realizado una solicitud para desplegar una aplicaci\u00f3n, pero la aplicaci\u00f3n no se puede localizar.
error.deploy.app.set.validate.useraction=Compruebe la especificaci\u00f3n del atributo appArchive.

info.deploy.app=CWWKM2156I: Desplegando la aplic {0}...
info.deploy.app.explanation=Se ha realizado una solicitud para desplegar una aplicaci\u00f3n y se ha iniciado el despliegue.
info.deploy.app.useraction=No se requiere ninguna acci\u00f3n.                         
error.deploy.app.fail=CWWKM2157E: No se ha podido desplegar la aplicaci\u00f3n {0}.
error.deploy.app.fail.explanation=Se ha realizado una solicitud para desplegar una aplicaci\u00f3n, pero el despliegue ha fallado.
error.deploy.app.fail.useraction=Compruebe el archivo server.xml del servidor en el que est\u00e1 desplegando la aplicaci\u00f3n. server.xml debe especificar todas las caracter\u00edsticas que necesita la aplicaci\u00f3n.

info.start.app=CWWKM2158I: La aplicaci\u00f3n {0} ya se ha iniciado en {1}.
info.start.app.explanation=Se ha realizado una solicitud para desplegar una aplicaci\u00f3n, pero la aplicaci\u00f3n ya se ha iniciado.
info.start.app.useraction=No se requiere ninguna acci\u00f3n.                         
error.deploy=CWWKM2159E: Liberty s\u00f3lo da soporte al despliegue de archivos war, eba, zip, ear o jar.
error.deploy.explanation=El servidor Liberty s\u00f3lo da soporte al despliegue de archivos war, eba, zip, ear y jar.
error.deploy.useraction=Corrija el nombre del archivo de aplicaci\u00f3n.

info.install.app=CWWKM2160I: Instalando la aplic {0}.
info.install.app.explanation=Se ha realizado una solicitud para instalar una aplicaci\u00f3n.
info.install.app.useraction=No se requiere ninguna acci\u00f3n.                         
error.undeploy.app.set.validate=CWWKM2161E: El atributo appArchive es necesario para la tarea de retirada del despliegue.
error.undeploy.app.set.validate.explanation=appArchive no se ha establecido correctamente.
error.undeploy.app.set.validate.useraction=Establezca el atributo appArchive para la tarea de retirada del despliegue.

error.undeploy.app.noexist=CWWKM2162E: La aplicaci\u00f3n {0} no existe.
error.undeploy.app.noexist.explanation=La tarea de retirada de despliegue no puede retirar el despliegue de la aplicaci\u00f3n porque la aplicaci\u00f3n no existe.
error.undeploy.app.noexist.useraction=Compruebe si la aplicaci\u00f3n existe en la carpeta dropins.

info.undeploy.app=CWWKM2163I: Retirando el despliegue de la aplicaci\u00f3n {0}.
info.undeploy.app.explanation=Se ha realizado una solicitud para retirar el despliegue de la aplicaci\u00f3n.
info.undeploy.app.useraction=No se requiere ninguna acci\u00f3n.                         
info.undeploy.success=CWWKM2164I: Se ha retirado correctamente el despliegue de la aplicaci\u00f3n {0}.
info.undeploy.success.explanation=Se ha realizado una solicitud para retirar el despliegue de una aplicaci\u00f3n y se ha completado.
info.undeploy.success.useraction=No se requiere ninguna acci\u00f3n.                         
error.undeploy.app.fail=CWWKM2165E: No se ha podido retirar el despliegue de la aplicaci\u00f3n {0}. No se ha encontrado el mensaje de detenci\u00f3n de la aplicaci\u00f3n en console.log.
error.undeploy.app.fail.explanation=Se ha realizado una solicitud para retirar el despliegue de una aplicaci\u00f3n, pero no se encuentra el mensaje de la aplicaci\u00f3n que se va a detener.
error.undeploy.app.fail.useraction=Compruebe la consola de servidor y el registro de rastreo para investigar por qu\u00e9 no se ha detenido la aplicaci\u00f3n.
